# Написать программу, которая будет выводить в консоль ёлочку заданной высоты

(lambda a: print('\n'.join(['*' * i for i in range(a)]))) (int(input("a = ")))